<template>
  <div class="index-page">
    <h1>Boilerplate для связки Nuxt + Vuex + SCSS</h1>
    <main>
      <p>Nuxt.js — это фреймворк для создания универсальных приложений на Vue.js с использованием Node.js. С помощью него можно рендерить UI на сервере и генерировать статические сайты.</p>
      <p>В Nuxt есть свои обязательные папки и файл конфигурации nuxt.config.js. В нем можно настроить заголовки сайта, подключить глобальные CSS, включить кэширование и многое другое.</p>
      <h3>Список папок</h3>
      <ul>
        <li>assets — Хранилище ресурсов, таких как: файлы глобальных стилей, изображения, видео и т.д.</li>
        <li>components — Компоненты приложения</li>
        <li>layouts — Шаблоны страниц, по умолчанию используется "default.vue"</li>
        <li>middleware — Позволяет определять пользовательские функции, которые могут быть запущены до отображения страницы или группы страниц (layouts).</li>
        <li>pages — Представления(наши страницы) и по тому как они распложены в этой папке он строит маршруты</li>
        <li>plugins — Плагины</li>
        <li>static — Статические файлы, например robots.txt или favicon.ico</li>
        <li>store — Хранилище Vuex</li>
      </ul>
      <hr />
      <h2>Команды используемые в проекте</h2>
      <ul>
        <li>npm run dev - запуск проекта для разработки</li>
        <li>npm run lint:js - запуск eslintrc (проверка на соотвествие стилю оформления кода JS)</li>
        <li>npm run lint:js:fix - запуск eslint, с автоматическим исправлением ошибок</li>
        <li>npm run lint:css - запуск stylelint (проверка на соотвествие стилю оформления SCSS и CSS, рассматриваются как и отдельные файлы, так и стили описанные в файлах .vue)</li>
        <li>npm run lint:css:fix - запуск stylelint, с автоматическим исправлением ошибок</li>
      </ul>
    </main>
  </div>
</template>
<script src="./index.js"></script>
<style lang="scss" scoped src="./index.scss"></style>



